<a href="https://colab.research.google.com/github/DuplamenteH/Ds/blob/master/DS_Project2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Importando dados

In [0]:
import pandas as pd

In [2]:
data = pd.read_csv('drive/My Drive/DadosAlura/aluguel.csv', sep=';')
data.head()

          Tipo               Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0  Apartamento               Centro        1  ...  20.0     53.33    Apartamento
1  Apartamento         Higienópolis        1  ...   0.0     16.67    Apartamento
2  Apartamento             Cachambi        2  ...  17.0     26.00    Apartamento
3  Apartamento               Grajaú        2  ...  74.0     21.43    Apartamento
4  Apartamento  Lins de Vasconcelos        3  ...  14.0     16.67    Apartamento

[5 rows x 11 columns]

#Informações gerais sobre o banco de dados

In [10]:
data.dtypes

Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64
Valor m2         float64
Tipo Agregado     object
dtype: object

In [14]:
tipo_dados= pd.DataFrame(data.dtypes, columns=['Tipos de dados'])
tipo_dados

              Tipos de dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [15]:
tipo_dados.columns.name='Variaveis'
tipo_dados

Variaveis     Tipos de dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [18]:
print('A base de dados apresenta {} registros imóveis e {} variáveis'.format(data.shape[0], data.shape[1]))

A base de dados apresenta 19831 registros imóveis e 11 variáveis

#Extras

##Lendo arquivos JSON

In [19]:
df_json= pd.read_json('drive/My Drive/DadosAlura/aluguel.json')
df_json.head()

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN

[5 rows x 9 columns]